Revit 2027 API
Rectangle Constructor
 Create an empty Rectangle instance with values (0,0,0,0).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Rectangle()
Public Sub New
public:
Rectangle()
new : unit -> Rectangle
See Also
Reference
Rectangle Class
Rectangle Overload
Autodesk.Revit.DB Namespace